In [2]:
# Series
import pandas as pd
kulfi = ['chocalate','mango','vanilla','strawberry','kesar']

pd.Series(kulfi)

0     chocalate
1         mango
2       vanilla
3    strawberry
4         kesar
dtype: object

In [3]:
lottery = [4,8,15,12,23,43]
pd.Series(lottery)

0     4
1     8
2    15
3    12
4    23
5    43
dtype: int64

In [4]:
reg = [True,False,False,True,False,True]
pd.Series(reg)

0     True
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [7]:
import numpy as np
import pandas as pd

#Object Creation
a = [1,3,5,np.nan,6,8]
s = pd.Series(a)

print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range('20130101', periods=6)
dates

df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.478644  0.053184 -0.778236  0.867616
2013-01-02  0.082328 -0.223408 -0.783709 -0.727670
2013-01-03 -1.263067 -1.146218 -0.294251  0.183701
2013-01-04 -2.335028  0.926512 -1.367826  1.259411
2013-01-05 -0.507226 -0.398195  1.928438 -0.434720
2013-01-06 -0.282638 -0.106882 -2.150360 -0.072052

In [11]:
#Creating a DataFrame by passing a dict of objects that can be converted to series-link
df2 = pd.DataFrame({
    'A':1.,
    'B':pd.Timestamp('20130102'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':pd.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test","train"]),
    'F':'foo'
})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
#The columns of the resulting DataFrame have different dtype
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [24]:
df2.apply

<bound method DataFrame.apply of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [25]:
#Here is how to view the top and buttom rows of the frame
df.head()

                   A         B         C         D
2013-01-01 -1.478644  0.053184 -0.778236  0.867616
2013-01-02  0.082328 -0.223408 -0.783709 -0.727670
2013-01-03 -1.263067 -1.146218 -0.294251  0.183701
2013-01-04 -2.335028  0.926512 -1.367826  1.259411
2013-01-05 -0.507226 -0.398195  1.928438 -0.434720

In [26]:
df.tail(3)

                   A         B         C         D
2013-01-04 -2.335028  0.926512 -1.367826  1.259411
2013-01-05 -0.507226 -0.398195  1.928438 -0.434720
2013-01-06 -0.282638 -0.106882 -2.150360 -0.072052

In [27]:
#Display the index, columns
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df.to_numpy()

array([[-1.4786442 ,  0.05318384, -0.77823649,  0.86761605],
       [ 0.08232816, -0.22340849, -0.78370931, -0.72766975],
       [-1.26306747, -1.1462177 , -0.29425101,  0.18370125],
       [-2.33502777,  0.92651167, -1.36782592,  1.25941111],
       [-0.50722615, -0.3981951 ,  1.92843802, -0.43471985],
       [-0.2826379 , -0.10688222, -2.15035989, -0.07205183]])